Report/SpectrumAPIFrameWorkV3/SpectrumAPIFrameWork/Result/10-Oct-2018/10-Oct-2018_18-20-08/Logs.log

10-10-2018 18:20:14 INFO [driverTest]: Starting execution at +:10-Oct-2018 18:20:08
10-10-2018 18:21:15 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:21:15 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:21:15 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_001 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:21:15 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:21:15 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:21:15 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Add xmlns="http://tempuri.org/">      <intA>3</intA>      <intB>3</intB>    </Add>  </soap:Body></soap:Envelope>
